

def main():
    for index in range(1000):
        q = 0.91 + index/100000.0

        balance = 500000000000 * 6144 * 5 * (1.0-q**855)/(1.0-q)
        print(q,"\t\t", balance)


        #0.91874
    total = 500000000000 * 6144 * 5 * (1.0)/(1.0-0.91874)
    print(0.91874,"\t\t", total, "\t", 5000 * 0.91874**855)

    for  index in range(1000):
        total = 500000000000 * 6144 * 5 /(1.0-0.91874 - index/100000.0)
        print(total)

    q3 = 0.91874
    total = 500000000000 * 6144 * 5 *(1.0 - q3**17) / (1.0 - q3)

    pos = total * 0.4

    b = 6144 * 5 * 17  * 5 * 50000* 100000000
    print(pos/b)


        
if __name__ == '__main__':
    main()

#预挖210 0000
#pow2100 0000  总量 2310 0000
#平均一分钟出一个块
#50年挖完
#衰减周期和现在保持一致
#等比衰减